### Pandas-DataFarme And Series

Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

(or)

Pandas in Python is an open-source data analysis and manipulation library. It provides powerful tools to work with structured data such as tables (rows and columns), making it especially useful for tasks like cleaning, analyzing, and visualizing datasets.


 Series → one-dimensional labeled array (like a column in Excel).

DataFrame → two-dimensional labeled data structure (like an Excel sheet or SQL table).

In [1]:

>>> import pandas as pd
>>> print(pd.__version__)

2.3.2

In [1]:
import pandas as pd

 Series :--

In [ ]:
## Series 
## A pandas SEries is a one-dimentional array-like object that can hold any data type.It is similar to a column is a table 

import pandas as pd 
data=[1,2,3,4,5,6,7,8,9]
series=pd.Series(data)
print("Series \n ",series)
print(type(series)) ## its showing the  which type of series

Series
  0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
## Create a Series from dictionary 

data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [10]:
data=[10,20,30,40,50]
index=['a','b','c','d','e']
pd.Series(data,index=index)

a    10
b    20
c    30
d    40
e    50
dtype: int64

 Dataframe:---

In [16]:
## Dataframe
## create a Dataframe from a dictionary of list 

data={

    'Name':['chiru','kiran','abhilash'],
    'Age':[23,45,34],
    'City':['Raichur','Shivmoga','Ballari']

}
df=pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age      City
0     chiru   23   Raichur
1     kiran   45  Shivmoga
2  abhilash   34   Ballari
<class 'pandas.core.frame.DataFrame'>

In [19]:
## Create a Data frame From a List of Dictionaries

data=[
   {'Name':'chiru','Age':22,'City':'mijar'},
   {'Name':'abhilish','Age':21,'City':'mijar'},
   {'Name':'suhas','Age':20,'City':'mijar'}
]

df=pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age   City
0     chiru   22  mijar
1  abhilish   21  mijar
2     suhas   20  mijar
<class 'pandas.core.frame.DataFrame'>

creating data from csv file:---

In [25]:


import pandas as pd 
df=pd.read_csv('data.csv')
df.head(50)

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [5]:
### Accesing Data From Dataframe

import pandas as pd

data = [
   {'Name':'chiru','Age':22,'City':'mijar'},
   {'Name':'abhilish','Age':21,'City':'mijar'},
   {'Name':'suhas','Age':20,'City':'mijar'}
]

df = pd.DataFrame(data)
print(df)      # ✅ Now works

       Name  Age   City
0     chiru   22  mijar
1  abhilish   21  mijar
2     suhas   20  mijar

In [9]:
## use data

data

[{'Name': 'chiru', 'Age': 22, 'City': 'mijar'},
 {'Name': 'abhilish', 'Age': 21, 'City': 'mijar'},
 {'Name': 'suhas', 'Age': 20, 'City': 'mijar'}]

In [10]:
## use df

df

       Name  Age   City
0     chiru   22  mijar
1  abhilish   21  mijar
2     suhas   20  mijar

In [11]:
df['Name']

0       chiru
1    abhilish
2       suhas
Name: Name, dtype: object

In [13]:
df['Age']

0    22
1    21
2    20
Name: Age, dtype: int64

In [15]:
type(df['Name'])

pandas.core.series.Series

 ### "loc"(location)

In [ ]:
df.loc[0]  ## it is  "loc"(location) operation it is mainly use chossing row index

Name    chiru
Age        22
City    mijar
Name: 0, dtype: object

In [17]:
df.loc[2]

Name    suhas
Age        20
City    mijar
Name: 2, dtype: object

### "iloc" (index location)

In [ ]:
df.iloc[0] ## it is  "iloc"--> (index location)  operation it is mainly use chossing row index

Name    chiru
Age        22
City    mijar
Name: 0, dtype: object

In [26]:
df.loc[0][0]

C:\Users\chira\AppData\Local\Temp\ipykernel_1228\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'2023-01-01'

In [28]:
df.iloc[0][0]

C:\Users\chira\AppData\Local\Temp\ipykernel_1228\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'2023-01-01'

In [35]:
df.iloc[0][5]

C:\Users\chira\AppData\Local\Temp\ipykernel_1228\3296793768.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][5]

'East'

In [ ]:


data = [
   {'Name':'chiru','Age':22,'City':'mijar'},
   {'Name':'abhilish','Age':21,'City':'mijar'},
   {'Name':'suhas','Age':20,'City':'mijar'},
   {'Name':'abhi','Age':20,'City':'tumkur'},
   {'Name':'raju','Age':24,'City':'moodbidiri'}
]

df = pd.DataFrame(data)
print(df)      # ✅ Now works

       Name  Age        City
0     chiru   22       mijar
1  abhilish   21       mijar
2     suhas   20       mijar
3      abhi   20      tumkur
4      raju   24  moodbidiri

In [42]:
data

[{'Name': 'chiru', 'Age': 22, 'City': 'mijar'},
 {'Name': 'abhilish', 'Age': 21, 'City': 'mijar'},
 {'Name': 'suhas', 'Age': 20, 'City': 'mijar'},
 {'Name': 'abhi', 'Age': 20, 'City': 'tumkur'},
 {'Name': 'raju', 'Age': 24, 'City': 'moodbidiri'}]

### Accessing a specified element

In [44]:
## Accessing a specified element 


df['Name']

0       chiru
1    abhilish
2       suhas
3        abhi
4        raju
Name: Name, dtype: object

In [45]:
df

       Name  Age        City
0     chiru   22       mijar
1  abhilish   21       mijar
2     suhas   20       mijar
3      abhi   20      tumkur
4      raju   24  moodbidiri

# "at"

In [ ]:
## Accessing a specified element using "at" 

df.at[2,'Age']

np.int64(20)

In [55]:
df.at[2,'Name']

'suhas'

# "iat" (index at)

In [56]:
## Accessing a specified element using "iat" (index at)

df.iat[2,2]

'mijar'

In [59]:
df.iat[1,0]

'abhilish'

In [60]:
## Data Manipulatiuon with  Dataframe 
df

       Name  Age        City
0     chiru   22       mijar
1  abhilish   21       mijar
2     suhas   20       mijar
3      abhi   20      tumkur
4      raju   24  moodbidiri

## Adding colomn

In [75]:
## Adding extra colomn in data 

df['Salary']=[50000,100000,30000,50000,90000]
df

       Name  Age        City  Salary
0     chiru   22       mijar   50000
1  abhilish   21       mijar  100000
2     suhas   20       mijar   30000
3      abhi   20      tumkur   50000
4      raju   24  moodbidiri   90000

## Remove colomn

In [ ]:
## Remove colomn 

df.drop('Salary', axis=1, inplace=True)

In [77]:
df

       Name  Age        City
0     chiru   22       mijar
1  abhilish   21       mijar
2     suhas   20       mijar
3      abhi   20      tumkur
4      raju   24  moodbidiri

In [78]:
## Add age to the column

df['Age']=df["Age"]+1
df

       Name  Age        City
0     chiru   23       mijar
1  abhilish   22       mijar
2     suhas   21       mijar
3      abhi   21      tumkur
4      raju   25  moodbidiri

In [79]:
df.drop(0,inplace=True)

In [80]:
df

       Name  Age        City
1  abhilish   22       mijar
2     suhas   21       mijar
3      abhi   21      tumkur
4      raju   25  moodbidiri

In [81]:

import pandas as pd 
df=pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [82]:
## Diaplay the data type of  each colomn 
print("Data types:\n",df.dtypes)

## Describe  the DataFrame 
print("Statistical summary:\n",df.describe())

Data types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object
Statistical summary:
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [83]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [3]:
# Create a Pandas DataFrame with a datetime index and one column filled with random integers

import numpy as np
date_rng = pd.date_range(start='2022-01-01', end='2022-12-31', freq='D')
df = pd.DataFrame(date_rng, columns=['date'])
df['data'] = np.random.randint(0, 100, size=(len(date_rng)))
df.set_index('date', inplace=True)
print("Original DataFrame:")
print(df)

# Resample the DataFrame to compute the monthly mean of the values
monthly_mean = df.resample('M').mean()
print("Monthly mean DataFrame:")
print(monthly_mean)

Original DataFrame:
            data
date
2022-01-01    85
2022-01-02    88
2022-01-03    19
2022-01-04    36
2022-01-05    27
...          ...
2022-12-27    66
2022-12-28    43
2022-12-29    77
2022-12-30    13
2022-12-31    62

[365 rows x 1 columns]
Monthly mean DataFrame:
                 data
date
2022-01-31  50.193548
2022-02-28  48.964286
2022-03-31  52.806452
2022-04-30  41.633333
2022-05-31  48.548387
2022-06-30  50.866667
2022-07-31  52.258065
2022-08-31  48.032258
2022-09-30  46.533333
2022-10-31  55.774194
2022-11-30  55.200000
2022-12-31  47.129032

C:\Users\chira\AppData\Local\Temp\ipykernel_28440\1263681010.py:12: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  monthly_mean = df.resample('M').mean()